---
kind: method
id: M:Autodesk.Revit.DB.FilterStringRuleEvaluator.Dispose
source: html/852de747-8837-d13a-5141-fdbbdd66fdce.htm
---
# Autodesk.Revit.DB.FilterStringRuleEvaluator.Dispose Method

Releases all resources used by the FilterStringRuleEvaluator

## Syntax (C#)
```csharp
public void Dispose()
```